In [5]:
import pandas as pd 
import matplotlib.pyplot as plt 
import numpy as np

In [6]:
df = pd.read_csv('encoding carprices.csv')

In [36]:
df.head(17)

    Mileage  Sell Price  Age  BMW X5  Mercedez Benz   Toyota
0     69000       18000    6       1               0       0
1     35000       34000    3       1               0       0
2     57000       26100    5       1               0       0
3     22500       40000    2       1               0       0
4     46000       31500    4       1               0       0
5     59000       29400    5       0               0       0
6     52000       32000    5       0               0       0
7     72000       19300    6       0               0       0
8     91000       12000    8       0               0       0
9     67000       22000    6       0               1       0
10    83000       20000    7       0               1       0
11    79000       21000    7       0               1       0
12    59000       33000    5       0               1       0
13    51000       42000    4       0               0       1
14    65000       32000    7       0               0       1
15    39000       55000    5       0               0       1

In [37]:
df.tail()

    Mileage  Sell Price  Age  BMW X5  Mercedez Benz   Toyota
11    79000       21000    7       0               1       0
12    59000       33000    5       0               1       0
13    51000       42000    4       0               0       1
14    65000       32000    7       0               0       1
15    39000       55000    5       0               0       1

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [10]:
df['Car Model'].unique()

array(['BMW X5', 'Audi', 'Mercedez Benz ', 'Toyota'], dtype=object)

In [11]:
ohc = OneHotEncoder()
ohc

OneHotEncoder()

In [12]:
ohc.fit_transform(df[['Car Model']]).toarray()

array([[0., 1., 0., 0.],
       [0., 1., 0., 0.],
       [0., 1., 0., 0.],
       [0., 1., 0., 0.],
       [0., 1., 0., 0.],
       [1., 0., 0., 0.],
       [1., 0., 0., 0.],
       [1., 0., 0., 0.],
       [1., 0., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.],
       [0., 0., 0., 1.],
       [0., 0., 0., 1.]])

In [13]:
ohc.categories_

[array(['Audi', 'BMW X5', 'Mercedez Benz ', 'Toyota'], dtype=object)]

In [14]:
dv = pd.get_dummies(df['Car Model'], drop_first = True)
dv.head()

   BMW X5  Mercedez Benz   Toyota
0       1               0       0
1       1               0       0
2       1               0       0
3       1               0       0
4       1               0       0

In [15]:
new_df = df.drop('Car Model', axis = 1) # dropping the "Car Model" column

In [16]:
new_df.head()

   Mileage  Sell Price  Age
0    69000       18000    6
1    35000       34000    3
2    57000       26100    5
3    22500       40000    2
4    46000       31500    4

In [21]:
df = pd.concat([new_df, dv], axis = 'columns')

In [22]:
df.head()

   Mileage  Sell Price  Age  BMW X5  Mercedez Benz   Toyota
0    69000       18000    6       1               0       0
1    35000       34000    3       1               0       0
2    57000       26100    5       1               0       0
3    22500       40000    2       1               0       0
4    46000       31500    4       1               0       0

In [26]:
y = df['Sell Price']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
13    42000
14    32000
15    55000
Name: Sell Price, dtype: int64

In [28]:
x = df.drop('Sell Price', axis = 'columns')
x

    Mileage  Age  BMW X5  Mercedez Benz   Toyota
0     69000    6       1               0       0
1     35000    3       1               0       0
2     57000    5       1               0       0
3     22500    2       1               0       0
4     46000    4       1               0       0
5     59000    5       0               0       0
6     52000    5       0               0       0
7     72000    6       0               0       0
8     91000    8       0               0       0
9     67000    6       0               1       0
10    83000    7       0               1       0
11    79000    7       0               1       0
12    59000    5       0               1       0
13    51000    4       0               0       1
14    65000    7       0               0       1
15    39000    5       0               0       1

In [30]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [31]:
model

LinearRegression()

In [32]:
model.fit(x, y)

LinearRegression()

In [33]:
model.score(x, y)

0.9461669991799323

In [42]:
model.predict([[63000,7, 0, 0, 1]])

/Users/masudulislam/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([37736.06221166])